app/views/posts/index.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]
---
              %i.fa.fa-comments-o
              = post.comments.count