app/controllers/posts_controller.rb

  def index
    @post = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def show
    @comments = Comment.where(post_id: @post)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 5

  def create
    @post = current_user.posts.build(post_params)


    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "link", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "posts"."id" = 2  [["title", "Sameer firstasasa"], ["image_updated_at", Wed, 20 Jul 2016 07:59:40 UTC +00:00], ["image_file_name", "drub4.jpg"], ["updated_at", Wed, 20 Jul 2016 07:59:40 UTC +00:00]]

  def find_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" != 5) ORDER BY RANDOM() LIMIT 1